pmo-dataset/mermaid/04.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	ParallelGateway_5{"+"} --> Task_6["Analyze performance\nfor future\noptimization"]
	ParallelGateway_3{"+"} --> Task_5["Select promotion\nchannels"]
	ParallelGateway_5 --> ParallelGateway_4{"+"}
	ParallelGateway_6{"+"} --> Task_4["Collect leads in CRM\nsystem"]
	ExclusiveGateway_1{"X"} --> ParallelGateway_4
	Task_3["Track performance in\nreal-time"] --> ParallelGateway_5
	ParallelGateway_3 --> Task_10["Design visuals"]
	Task_8["Define campaign\nobjectives"] --> ParallelGateway_3
	ExclusiveGateway_2{"X"} --> ExclusiveGateway_1
	Task_9["Campaign period ends"] --> ParallelGateway_2{"+"}
	Task_5 --> ParallelGateway_1{"+"}
	ExclusiveGateway_2 --> Task_2["Sales teams follows\nup on leads"]
	Task_6 --> ParallelGateway_2
	Task_4 --> ExclusiveGateway_2
	Task_10 --> ParallelGateway_1
	ParallelGateway_1 --> Task_7["Launch campaign"]
	Task_7 --> ParallelGateway_6
	ParallelGateway_2 --> EndNoneEvent_1(("end")):::endEvent
	ParallelGateway_4 --> Task_9
	ParallelGateway_6 --> Task_3
	StartNoneEvent_1(("start")) --> Task_8
	Task_2 --> ExclusiveGateway_1
	Task_1["Create content"] --> ParallelGateway_1
	ParallelGateway_3 --> Task_1
